controllers/ActivityController.php

INSERT INTO `activity` (`type`, `title`, `content`, `publishedDate`, `isRead`, `imgs`) VALUES (2, 'test', 'Hi this is activity of type 0', '2022-09-18 06:33:48', 0, '')
---
    public function actionAdd()
    {
        try {
            $data = (array)(Yii::$app->request->post());
            if (!isset($data['type']) || !isset($data['content']) || !isset($data['title']))
                return ["status" => "error", "details" => "There are missing params"];

            if (!in_array($data['type'], Activity::ACTIVITY_TYPE)) {
                return ['status' => 'error', 'details' => 'The type of activity is not valid'];
            }

            $newActivity = new Activity();
            $newActivity->type = $data['type'];
            $newActivity->title = $data['title'];
            $newActivity->content = $data['content'];
            $newActivity->publishedDate = date('Y-m-d h:i:s');
            $activityImages = UploadedFile::getInstancesByName('activityImages');
            $imagesName = [];
            if (!empty($activityImages)) {
                HelperFunction::createFolderIfNotExist('@app/web/activities/images');

                foreach ($activityImages as $img) {
                    $name = Yii::$app->security->generateRandomString(5) . '.' . $img->extension;
                    $img->saveAs(Url::to('@app/web/activities/images') . '/' . $name);
                    $imagesName[] = $name;
                }
            }
            $newActivity->imgs = implode(',', $imagesName);
            if ($newActivity->validate()) {
                $newActivity->save();