controllers/AreaController.php

    public function actionReadCities()
    {
        try {
            $spreadSheet = IOFactory::load(Url::to('@app/web/cities.xlsx'));
            $spreadSheetArray = $spreadSheet->getActiveSheet()->toArray();
            array_splice($spreadSheetArray, 0, 1);
            foreach ($spreadSheetArray as $city) {
                $newCity = new City();
                $newCity->nameEn = $city[0];
                $newCity->nameAr = $city[1];
                $newCity->countryId = 1;
                $newCity->save();
---
INSERT INTO `city` (`nameEn`, `nameAr`, `countryId`) VALUES ('Al-Hasakeh', 'الحسكة', 1)