controllers/CompanyController.php

SELECT * FROM `company_team` WHERE `companyId`=1
SELECT * FROM `company` WHERE `id`=1
SELECT * FROM `contact` WHERE `companyId`=1
---
    public function actionGet($id)
    {
        try {
            $company = Company::find()
                ->where(['id' => (int)$id])
                ->with("companyTeams", "contacts")
                ->asArray()
                ->one();

INSERT INTO `company` (`name`, `description`, `numOfEmployee`) VALUES ('Muhammad Co.', 'Hi this company belongs to muhammad nawlo', 50)
---
                $company->logo = $name;
            }

            if ($company->validate() && $company->save()) {

INSERT INTO `contact` (`type`, `content`, `companyId`) VALUES (1, '+96355548214', 3)
---
                        $companyContact->companyId = $company->id;

                        if ($companyContact->validate()) {
                            $companyContact->save();

SELECT EXISTS(SELECT * FROM `company` WHERE `company`.`id`=3)
---
                        }
                    }
                }
                $company = Company::find()->with("companyTeams", "contacts")->asArray()->one();