controllers/MedicineController.php

SELECT * FROM `pharmaceutical_form` WHERE `id`=1
SELECT * FROM `category` WHERE `id`='1'
---
    public function actionAdd()
    {
        $data = (array)(Yii::$app->request->post());
        if (
            !isset($data['productName']) ||
            !isset($data['indications']) ||
            !isset($data['packing']) ||
            !isset($data['composition']) ||
            !isset($data['price']) ||
            !isset($data['netPrice']) ||
            !isset($data['pharmaceuticalFormId']) ||
            !isset($data['categoryId'])
        ) {
            return ['status' => 'error', 'details' => 'There are missing params'];
        }
        try {
            $pharmaceuticalForm = PharmaceuticalForm::findOne(['id' => (int)$data['pharmaceuticalFormId']]);
            $category = Category::findOne(['id' => $data['categoryId']]);

INSERT INTO `medicine_pharmaceutical_form` (`medicineId`, `pharmaceuticalFormId`) VALUES (4, 1)
---
                $pm->medicineId = $newMedicine->id;
                $pm->pharmaceuticalFormId = $pharmaceuticalForm->id;
                if ($pm->validate()) {
                    $pm->save();

SELECT * FROM `medicine` WHERE `id`=34
SELECT EXISTS(SELECT * FROM `medicine` WHERE `medicine`.`id`=44)
---
    public function actionGetAll($searchText = null)
    {
        if ($searchText != null) {
            $medicines = Medicine::find()
                ->where(['like', 'productName', trim($searchText) . '%', false])
                ->asArray()->all();
        } else {
            $medicines = Medicine::find()
                ->asArray()->all();