controllers/MedicineController.php

INSERT INTO `medicine` (`barcode`, `productName`, `indications`, `packing`, `composition`, `expiredDate`, `price`, `netPrice`) VALUES ('11111', 'Muhammad', 'this is test medice', 50, 'fsdfdsfdsfdsf', '2022/02/02', 1500, 1500)
---
            HelperFunction::createFolderIfNotExist(Url::to('@app/web/excelFiles/medicines'));


            $writer->save("excelFiles/medicines" . $fileName . ".xlsx");

SELECT EXISTS(SELECT * FROM `category` WHERE `category`.`id`=9)
SELECT EXISTS(SELECT * FROM `pharmaceutical_form` WHERE `pharmaceutical_form`.`id`=11)
---
                        array_push($errorArr, ['error' => "<b>$m[0]</b> Medicine name should not be empty"]);
                        continue;
                    }
                    $category = Category::findOne(['name' => trim($m[7])]);
                    $pharmaceuticalForm = PharmaceuticalForm::findOne(['name' => trim($m[8])]);

SELECT * FROM `medicine` WHERE `id`=1
---
                    $newMedicine->barcode = $generateName;
                    $newMedicine->save();
                }
                $newAddedMedicine = Medicine::find()->where(['in', 'id', $ids])->with('categories', 'pharmaceuticalForms')->asArray()->all();

SELECT EXISTS(SELECT * FROM `pharmaceutical_form` WHERE `pharmaceutical_form`.`id`=1)
SELECT * FROM `pharmaceutical_form` WHERE `id`=1
SELECT * FROM `category` WHERE `id`='1'
SELECT EXISTS(SELECT * FROM `category` WHERE `category`.`id`=1)
---
    public function actionAdd()
    {
        $data = (array)(Yii::$app->request->post());
        if (
            !isset($data['productName']) ||
            !isset($data['indications']) ||
            !isset($data['packing']) ||
            !isset($data['composition']) ||
            !isset($data['price']) ||
            !isset($data['netPrice']) ||
            !isset($data['pharmaceuticalFormId']) ||
            !isset($data['categoryId'])
        ) {
            return ['status' => 'error', 'details' => 'There are missing params'];
        }
        try {
            $pharmaceuticalForm = PharmaceuticalForm::findOne(['id' => (int)$data['pharmaceuticalFormId']]);
            $category = Category::findOne(['id' => $data['categoryId']]);

INSERT INTO `medicine` (`productName`, `indications`, `packing`, `composition`, `expiredDate`, `price`, `netPrice`) VALUES ('Muhammad', 'this is test medice', 50, 'fsdfdsfdsfdsf', 2, 1500, 1500)
---
                $newMedicine->imgs = implode(',', $imagesName);
            }
            if ($newMedicine->validate()) {
                $newMedicine->save();

INSERT INTO `medicine_pharmaceutical_form` (`medicineId`, `pharmaceuticalFormId`) VALUES (2, 1)
---
                $pm->medicineId = $newMedicine->id;
                $pm->pharmaceuticalFormId = $pharmaceuticalForm->id;
                if ($pm->validate()) {
                    $pm->save();

SELECT EXISTS(SELECT * FROM `medicine` WHERE `medicine`.`id`=2)
SELECT * FROM `medicine` WHERE `id`=1
---
                }

                // Generate barcode
                $newMedicine = Medicine::findOne(['id' => $newMedicine->id]);

SELECT * FROM `medicine_pharmaceutical_form` WHERE `medicineId`=1
SELECT EXISTS(SELECT * FROM `pharmaceutical_form` WHERE `pharmaceutical_form`.`id`=1)
SELECT EXISTS(SELECT * FROM `category` WHERE `category`.`id`=1)
---
    public function actionUpdate()
    {
        $data = (array)(Yii::$app->request->post());
        if (
            !isset($data['productName']) ||
            !isset($data['indications']) ||
            !isset($data['packing']) ||
            !isset($data['composition']) ||
            !isset($data['price']) ||
            !isset($data['netPrice']) ||
            !isset($data['pharmaceuticalFormId']) ||
            !isset($data['categoryId']) ||
            !isset($data['id'])
        ) {
            return ['status' => 'error', 'details' => 'There are missing params'];
        }

        try {
            $pharmaceuticalForm = PharmaceuticalForm::findOne(['id' => (int)$data['pharmaceuticalFormId']]);
            $category = Category::findOne(['id' => $data['categoryId']]);

UPDATE `medicine` SET `barcode`='kmp8z.png' WHERE `id`=1
---
                $imagesName = [];
                foreach ($medicineImages as $img) {
                    $name = Yii::$app->security->generateRandomString(5) . '.' . $img->extension;
                    $img->saveAs(Url::to('@app/web/medicines/images') . '/' . $name);

SELECT * FROM `medicine_pharmaceutical_form` WHERE `medicineId` IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
SELECT * FROM `pharmaceutical_form` WHERE `id` IN (1, 2, 3)
---
    public function actionGet($id = null)
    {
        try {
            if ($id === null) {
                return ['status' => 'error', 'details' => 'You should send id'];
            }
            $medicine = Medicine::find()
                ->where(['id' => (int)$id])
                ->with('categories', 'pharmaceuticalForms')
                ->asArray()
                ->one();