controllers/MedicineController.php

SELECT EXISTS(SELECT * FROM `medicine` WHERE `medicine`.`id`=4)
SELECT * FROM `medicine` WHERE `productName`='test'
---
                        array_push($errorArr, ['error' => "There are missing data in this row ($i)"]);
                    }
                    $i++;
                    $isExsist = Medicine::findOne(['productName' => trim($m[0])]);

SELECT EXISTS(SELECT * FROM `category` WHERE `category`.`id`=1)
SELECT * FROM `category` WHERE `name`='Test cat'
SELECT EXISTS(SELECT * FROM `pharmaceutical_form` WHERE `pharmaceutical_form`.`id`=1)
SELECT * FROM `pharmaceutical_form` WHERE `name`='test phar'
---
                        array_push($errorArr, ['error' => "<b>$m[0]</b> Medicine name should not be empty"]);
                        continue;
                    }
                    $category = Category::findOne(['name' => trim($m[7])]);
                    $pharmaceuticalForm = PharmaceuticalForm::findOne(['name' => trim($m[8])]);

INSERT INTO `category` (`name`) VALUES ('Test cat')
---
                            continue;
                        }
                        $category->name =  trim($m[7]);
                        $category->save();

INSERT INTO `pharmaceutical_form` (`name`) VALUES ('sdfs')
---
                        }
                        $pharmaceuticalForm = new PharmaceuticalForm();
                        $pharmaceuticalForm->name =  trim($m[8]);
                        $pharmaceuticalForm->save();

INSERT INTO `medicine` (`barcode`, `productName`, `indications`, `packing`, `composition`, `expiredDate`, `price`, `netPrice`) VALUES ('222', 'test', 'test', 50, '33', '2022-09-09', 1000, 100)
---
                    $newMedicine->price = (float)$m[5];
                    $newMedicine->netPrice = (float) $m[6];
                    if ($newMedicine->validate()) {
                        $newMedicine->save();

INSERT INTO `medicine_pharmaceutical_form` (`medicineId`, `pharmaceuticalFormId`) VALUES (5, 11)
---
                        $pm->medicineId = $newMedicine->id;
                        $pm->pharmaceuticalFormId = $pharmaceuticalForm->id;

                        $pm->save();

SELECT EXISTS(SELECT * FROM `medicine` WHERE `medicine`.`id`=7)
---
                        array_push($errorArr, ['error' => "<b>$m[0]</b> ", 'details' => $newMedicine->getErrors()]);
                    }
                    // Generate barcode
                    $newMedicine = Medicine::findOne(['id' => $newMedicine->id]);

SELECT * FROM `pharmaceutical_form` WHERE `id`=1
SELECT * FROM `category` WHERE `id`='1'
SELECT * FROM `medicine`
---
    public function actionAdd()
    {
        $data = (array)(Yii::$app->request->post());
        if (
            !isset($data['productName']) ||
            !isset($data['indications']) ||
            !isset($data['packing']) ||
            !isset($data['composition']) ||
            !isset($data['price']) ||
            !isset($data['netPrice']) ||
            !isset($data['pharmaceuticalFormId']) ||
            !isset($data['categoryId'])
        ) {
            return ['status' => 'error', 'details' => 'There are missing params'];
        }
        try {
            $pharmaceuticalForm = PharmaceuticalForm::findOne(['id' => (int)$data['pharmaceuticalFormId']]);
            $category = Category::findOne(['id' => $data['categoryId']]);
            if ($pharmaceuticalForm === null) {

                return ['status' => 'error', 'details' => 'Pharmaceutical Form Id is not valid'];
            }
            if ($category === null) {
                return ['status' => 'error', 'details' => 'Category Id is not valid'];
            }

            $newMedicine = new Medicine();
            $newMedicine->load($data, '');

INSERT INTO `medicine` (`barcode`, `productName`, `indications`, `packing`, `composition`, `expiredDate`, `price`, `netPrice`, `imgs`) VALUES ('111112', 'Muhammad', 'this is test medice', 50, 'fsdfdsfdsfdsf', 2, 1500, 1500, '6UNXn.jpg,eWYZ8.jpg,Hofzn.png')
---
                $imagesName = [];
                foreach ($medicineImages as $img) {
                    $name = Yii::$app->security->generateRandomString(5) . '.' . $img->extension;
                    $img->saveAs(Url::to('@app/web/medicines/images') . '/' . $name);

UPDATE `medicine` SET `barcode`='‰PNG\r\n\Z\n\0\0\0\rIHDR\0\0\0r\0\0\0\0\0\0Ê%Ø\0\0\0PLTEÿÿÿ\0\0\0UÂÓ~\0\0\0tRNS\0@æØf\0\0\0	pHYs\0\0Ä\0\0Ä•+\0\0\0IDAT•cøÌÃ|ØžŸÇÞÞþÌ{ã£üaÅ\0oü­­Ü<þ\0\0\0\0IEND®B`‚' WHERE `id`=34
INSERT INTO `medicine` (`productName`, `indications`, `packing`, `composition`, `expiredDate`, `price`, `netPrice`, `imgs`) VALUES ('Muhammad', 'this is test medice', 50, 'fsdfdsfdsfdsf', 2, 1500, 1500, 'NZa54.jpg,pIDMJ.png')
---
                $newMedicine->imgs = implode(',', $imagesName);
            }
            if ($newMedicine->validate()) {
                $newMedicine->save();

INSERT INTO `medicine_pharmaceutical_form` (`medicineId`, `pharmaceuticalFormId`) VALUES (17, 1)
---
                $pm->medicineId = $newMedicine->id;
                $pm->pharmaceuticalFormId = $pharmaceuticalForm->id;
                if ($pm->validate()) {
                    $pm->save();

SELECT * FROM `medicine` WHERE `id`=44
SELECT EXISTS(SELECT * FROM `medicine` WHERE `medicine`.`id`=24)
---
                }

                // Generate barcode
                $newMedicine = Medicine::findOne(['id' => $newMedicine->id]);

UPDATE `medicine` SET `barcode`='yhEt_.png' WHERE `id`=1
---
                $generateName = Yii::$app->security->generateRandomString(5) . '.png';
                file_put_contents(Url::to('@app/web/medicines/barcodes') . '/' . $generateName, $generator->getBarcode($newMedicine->id, $generator::TYPE_CODE_128));
                $newMedicine->barcode = $generateName;
                $newMedicine->save();

SELECT * FROM `medicine_pharmaceutical_form` WHERE `medicineId`=1
SELECT EXISTS(SELECT * FROM `pharmaceutical_form` WHERE `pharmaceutical_form`.`id`=1)
SELECT EXISTS(SELECT * FROM `category` WHERE `category`.`id`=1)
SELECT EXISTS(SELECT * FROM `medicine` WHERE `medicine`.`id`=1)
SELECT * FROM `medicine` WHERE `id`=2
---
    public function actionUpdate()
    {
        $data = (array)(Yii::$app->request->post());
        if (
            !isset($data['productName']) ||
            !isset($data['indications']) ||
            !isset($data['packing']) ||
            !isset($data['composition']) ||
            !isset($data['price']) ||
            !isset($data['netPrice']) ||
            !isset($data['pharmaceuticalFormId']) ||
            !isset($data['categoryId']) ||
            !isset($data['id'])
        ) {
            return ['status' => 'error', 'details' => 'There are missing params'];
        }

        try {
            $pharmaceuticalForm = PharmaceuticalForm::findOne(['id' => (int)$data['pharmaceuticalFormId']]);
            $category = Category::findOne(['id' => $data['categoryId']]);
            if ($pharmaceuticalForm === null) {
                return ['status' => 'error', 'details' => 'Pharmaceutical Form Id is not valid'];
            }
            if ($category === null) {
                return ['status' => 'error', 'details' => 'Category Id is not valid'];
            }

            $medicine = Medicine::findOne(['id' => (int)$data['id']]);

UPDATE `medicine` SET `barcode`='111111', `productName`='Muhammad1', `indications`='this is test medice 1', `packing`=500, `expiredDate`=5, `price`=2000, `netPrice`=200 WHERE `id`=1
---
                $imagesName = [];
                foreach ($medicineImages as $img) {
                    $name = Yii::$app->security->generateRandomString(5) . '.' . $img->extension;
                    $img->saveAs(Url::to('@app/web/medicines/images') . '/' . $name);

SELECT * FROM `pharmaceutical_form` WHERE `id`=1
SELECT EXISTS(SELECT * FROM `pharmaceutical_form` WHERE `pharmaceutical_form`.`id`=1)
SELECT * FROM `category` WHERE `id`='1'
SELECT EXISTS(SELECT * FROM `category` WHERE `category`.`id`=1)
---
            }
            if ($medicine->validate()) {
                $medicine->save();
                MedicinePharmaceuticalForm::findOne(['medicineId' => $medicine->id])->delete();
                MedicineCategory::findOne(['medicineId' => $medicine->id])->delete();

SELECT EXISTS(SELECT * FROM `medicine` WHERE `medicine`.`id`=1)
---
                    return ['status' => 'error', 'details' => $c->getErrors()];
                }
                // Generate barcode
                $newMedicine = Medicine::findOne(['id' => $medicine->id]);

UPDATE `medicine` SET `barcode`='111111', `productName`='Muhammad1', `indications`='this is test medice 1', `packing`=500, `expiredDate`=5, `imgs`='rT5FW.jpg,Wh29X.jpg,PxSU8.jpg', `price`=2000, `netPrice`=200 WHERE `id`=1
---
                $generateName = Yii::$app->security->generateRandomString(5) . '.png';
                file_put_contents(Url::to('@app/web/medicines/barcodes') . '/' . $generateName, $generator->getBarcode($newMedicine->id, $generator::TYPE_CODE_128));
                $newMedicine->barcode = $generateName;
                $newMedicine->save();

SELECT EXISTS(SELECT * FROM `medicine` WHERE `medicine`.`id`=1)
SELECT * FROM `medicine` WHERE `id`=1
---
    public  function actionDelete()
    {
        try {
            $data = (array)json_decode(Yii::$app->request->getRawBody(), true);
            if (!isset($data['id'])) {
                return ["status" => "error", "details" => "There are missing param"];
            }
            MedicineCategory::deleteAll(['medicineId' => (int)$data['id']]);
            MedicinePharmaceuticalForm::deleteAll(['medicineId' => (int)$data['id']]);
            $medicine = Medicine::findOne(['id' => (int)$data['id']]);

SELECT * FROM `medicine_pharmaceutical_form` WHERE `medicineId` IN (1, 2, 3, 4)
SELECT * FROM `pharmaceutical_form` WHERE `id`=1
---
    public function actionGet($id = null)
    {
        try {
            if ($id === null) {
                return ['status' => 'error', 'details' => 'You should send id'];
            }
            $medicine = Medicine::find()
                ->where(['id' => (int)$id])
                ->with('categories', 'pharmaceuticalForms')
                ->asArray()
                ->one();

SELECT * FROM `medicine_pharmaceutical_form` WHERE `medicineId` IN (1, 2, 3, 4, 5)
SELECT * FROM `pharmaceutical_form` WHERE `id` IN (1, 2, 3)
---
    public function actionGetAll()
    {
        try {
            $medicines = Medicine::find();

            $data = (array)json_decode(Yii::$app->request->getRawBody());
            if (!isset($data['searchFilters']))
                return ['status' => 'error', 'details' => 'There are missing params'];

            $searchFilters = (array)$data['searchFilters']->filters;
            $searchText = trim($data['searchFilters']->searchText);

            foreach ($searchFilters as $s) {
                $s = (array)$s;
                if (!isset($s['name']) || !isset($s['status']))
                    continue;
                if (!in_array($s['name'], ['productName', 'indications', 'composition']))
                    continue;

                if ((bool)$s['status'] === true)
                    $medicines->andFilterWhere(['like', $s['name'],  '%' . trim($searchText) . '%', false]);
            }

            $medicines = $medicines
                ->with('categories', 'pharmaceuticalForms')
                ->asArray()
                ->all();