controllers/OfferController.php

    function actionAdd()
    {
        try {
            $errors = [];
            $data = (array)json_decode(Yii::$app->request->getRawBody());
            if (!isset($data['name']) || !isset($data['offerDetails']))
                return ['status' => 'error', 'details' => 'There are missing params (name or offerDetail)'];

            $offerDetails = (array)$data['offerDetails'];
            if (empty($offerDetails))
                return ['status' => 'error', 'details' => 'Offer details should not be empty'];

            $newOffer = new Offer();
            $newOffer->name = trim($data['name']);
            $newOffer->creationDate = date('Y-m-d');
            $newOffer->offerStatus = 1;
            if ($newOffer->validate()) {
                $newOffer->save();
                foreach ($offerDetails as $o) {
                    $o = (array)$o;
                    $newOfferDetails = new OfferDetails();
                    $newOfferDetails->offerId = $newOffer->id;
                    $newOfferDetails->medicineId = (int)$o['medicineId'];
                    $newOfferDetails->quantity = (int)$o['quantity'];
                    $newOfferDetails->extraMedicineId = (int)$o['extraMedicineId'];
                    $newOfferDetails->extraQuantity = (int)$o['extraQuantity'];
                    if ($newOfferDetails->validate()) {
                        $newOfferDetails->save();
---
INSERT INTO `offer` (`name`, `creationDate`, `offerStatus`) VALUES ('Offer 1', '2022-09-19', 1)
INSERT INTO `offer_details` (`offerId`, `medicineId`, `quantity`, `extraMedicineId`, `extraQuantity`) VALUES (1, 1, 10, 1, 1)

    function actionChangeStatus($id, $status)
    {
        try {
            $offer = Offer::findOne(['id' => (int)$id]);
---
SELECT * FROM `offer` WHERE `id`=1

    function actionDelete()
    {
        try {
            $id = Yii::$app->request->post('id');
            if ($id === null)
                return ['status' => 'error', 'details' => 'There is a missing param'];

            $offer = Offer::findOne(['id' => (int)$id]);
---
SELECT * FROM `offer` WHERE `id`=5