controllers/OrderController.php

INSERT INTO `order` (`userId`, `representativeId`, `orderDate`, `isCanceled`, `isCompleted`) VALUES (1, 4, '2022-09-07 15:58:32', 0, 0)
INSERT INTO `order_details` (`orderId`, `offerId`, `quantity`) VALUES (7, 3, 10)
---
    function actionAdd()
    {
        try {
            $errors = [];
            $data = (array)json_decode(Yii::$app->request->getRawBody());
            if (!isset($data['userId']) || !isset($data['representativeId']) || !isset($data['orderDetails']))
                return ['status' => 'error', 'details' => 'There are missing params (userId or representativeId or orderDetails)'];

            $orderDetails = $data['orderDetails'];
            if (empty($orderDetails))
                return ['status' => 'error', 'details' => 'Order details should not be empty'];

            if ((int)$data['representativeId'] === (int)$data['userId'])
                return ['status' => 'error', 'details' => 'User id should not be the same as Representative id'];

            $newOrder = new Order();
            $newOrder->userId = (int)$data['userId'];
            $newOrder->representativeId = (int)$data['representativeId'];
            $newOrder->orderDate = date('Y-m-d H:i:s');
            $newOrder->isCanceled = 0;
            $newOrder->isCompleted = 0;
            if ($newOrder->validate()) {
                $newOrder->save();
                foreach ($orderDetails as $o) {
                    $o = (array)$o;
                    $newOrderDetails = new OrderDetails();
                    $newOrderDetails->orderId = $newOrder->id;
                    $newOrderDetails->offerId = (int)$o['offerId'];
                    $newOrderDetails->quantity = (int)$o['quantity'];
                    if ($newOrderDetails->validate()) {
                        $newOrderDetails->save();

SELECT * FROM `order`
SELECT * FROM `user` WHERE `id` IN (2, 1, 4)
---
    function actionGetAll()
    {
        try {
            $orders = Order::find()->with('representative', 'user')->asArray()->all();

SELECT * FROM `offer` WHERE `id` IN (1, 3)
SELECT * FROM `order_details` WHERE `orderId`=1
SELECT * FROM `order` WHERE `id`=1
SELECT * FROM `medicine` WHERE `id`=5
SELECT * FROM `offer` WHERE `id`=1
---
    function actionGet($id)
    {
        try {
            $order = Order::find()->where(['id' => (int)$id])->with('offers', 'orderDetails')->asArray()->one();

            if ($order === null)
                return ['status' => 'error', 'details' => 'There is no order that has this id'];

            $offers = [];

            foreach ($order['offers'] as $key => $offer) {
                $offer  = Offer::find()->where(['id' => $offer['id']])
                    ->with('medicines', 'extraMedicines')
                    ->asArray()
                    ->one();