controllers/OrderController.php

    function actionGetAllCanceled($isCanceled = 0, $year = null, $month = null)
    {
        try {
            $orders = Order::find();
            if (Yii::$app->user->identity->role === 5) {
                $orders = Order::find()->where(['isCanceled' => (int)$isCanceled]);
            } else {
                $orders = Order::find()->where(['isCanceled' => (int)$isCanceled, 'userId' => Yii::$app->user->identity->id]);
            }

            if ($year != null && $month != null) {
                $month = str_pad($month, 2, '0', STR_PAD_LEFT);
                $endDayMonth = date('t', strtotime("$year-$month-01"));
                $orders->andFilterWhere(['between', 'orderDate', date('Y-m-d H:i:s', strtotime("$year-$month-01")), date('Y-m-d H:i:s', strtotime("$year-$month-$endDayMonth"))]);
            }

            $orders = Order::find()
                ->with('representative', 'user')
                ->asArray()
                ->all();
---
SELECT * FROM `order` WHERE `isCanceled`=1
SELECT * FROM `user` WHERE `id`=2