controllers/PharmaceuticalFormController.php

    public function actionImportExcelFile()
    {
        try {
            if (isset($_FILES['sheet'])) {
                $file = $_FILES['sheet'];
                $tmpName = yii::$app->security->generateRandomString();
                $inputFile = 'excelFiles/pharmaceuticalForms' . $tmpName . '.xlsx';
                move_uploaded_file($file['tmp_name'], $inputFile);
                $spreadSheet = \PhpOffice\PhpSpreadsheet\IOFactory::load($inputFile);
                $pharmaceuticalFormArray = $spreadSheet->getActiveSheet()->toArray();
                //To remove the first row in file
                $tmpExcelFields = array_splice($pharmaceuticalFormArray, 0, 1);
                //This condition to check the template
                if (
                    $tmpExcelFields[0][0] != 'Name'
                ) {
                    return ['status' => 'error', 'details' => 'This excel file is not a validate file'];
                }
                $i = 0;
                $errorArr = [];
                foreach ($pharmaceuticalFormArray as $p) {
                    $i++;
                    $isExist = PharmaceuticalForm::findOne(['name' => trim($p[0])]);
---
SELECT EXISTS(SELECT * FROM `pharmaceutical_form` WHERE `pharmaceutical_form`.`name`='phar14')
SELECT * FROM `pharmaceutical_form` WHERE `id`=1

                        }
                        $newPharmaceuticalForm->name = trim($p[0]);
                        if ($newPharmaceuticalForm->validate()) {
                            $newPharmaceuticalForm->save();
---
INSERT INTO `pharmaceutical_form` (`name`) VALUES ('phar14')
UPDATE `pharmaceutical_form` SET `name`='phar1' WHERE `id`=1

    public function actionAdd()
    {
        try {
            $errors = [
                'notExist' => [],
                'pharmaceuticalFormErrors' => [],
                'used' => [],
            ];


            $data = json_decode(Yii::$app->request->getRawBody(), true);
            if (!isset($data['pharmaceuticalForms'])) {
                return ["status" => "error", "details" => "There are missing params (pharmaceuticalForms)"];
            }

            if (!isset($data['deletedPharmaceuticalForms'])) {
                return ["status" => "error", "details" => "There is missing params (deletedPharmaceuticalForms)"];
            }

            if (!empty($data['deletedPharmaceuticalForms'])) {
                foreach ($data['deletedPharmaceuticalForms'] as $id) {
                    $pharmaceuticalForm = PharmaceuticalForm::findOne(['id' => (int)$id]);
---
SELECT * FROM `pharmaceutical_form` WHERE `id`=1

                if ($p['id'] === '') {
                    $newPharmaceuticalForm = new PharmaceuticalForm();
                } else {
                    $newPharmaceuticalForm = PharmaceuticalForm::findOne(['id' => (int)$p['id']]);
---
SELECT * FROM `pharmaceutical_form` WHERE `id`=1

                }
                $newPharmaceuticalForm->name = trim($p['name']);
                if ($newPharmaceuticalForm->validate()) {
                    $newPharmaceuticalForm->save();
---
INSERT INTO `pharmaceutical_form` (`name`) VALUES ('phar34')

    function actionGetMedicines($id)
    {
        try {
            $pharmaceuticalForm = PharmaceuticalForm::find()->with('medicines')->where(['id' => (int)$id])->asArray()->one();
---
SELECT * FROM `medicine_pharmaceutical_form` WHERE `pharmaceuticalFormId`=1
SELECT * FROM `medicine` WHERE `id`=1
SELECT * FROM `pharmaceutical_form` WHERE `id`=1