controllers/SiteController.php

SELECT * FROM `user` WHERE `email`='nawlomuhammad@gmail.com'
---
    public function actionLogin()
    {
        $data = (array)json_decode(Yii::$app->request->getRawBody(), true);
        if (!isset($data['email']) || !isset($data['password'])) {
            return ['status' => 'error', 'details' => 'There are missing params'];
        }
        $isValidRequest = HelperFunction::checkEmptyData([$data['email'], $data['password']]);
        if ($isValidRequest) return $isValidRequest;

        $user = User::find()->where(['email' => $data['email']])->with('contacts')->one();

INSERT INTO `user` (`email`, `firstName`, `lastName`, `password`) VALUES ('admin@gmail.com', 'Muhammad', 'Nawlo', '$2y$13$aNPZHtvVTFZkhHFLD9S8FebkkmTgEG43QNU7fAAXmkqEOMc8yHOee')
---
    public function actionSignup()
    {
        try {
            $data = (array)json_decode(Yii::$app->request->getRawBody());
            $email = ArrayHelper::getValue($data, 'email', '');
            $password = ArrayHelper::getValue($data, 'password', '');
            $firstName = ArrayHelper::getValue($data, 'firstName', '');
            $lastName = ArrayHelper::getValue($data, 'lastName', '');
            $isDataValid = HelperFunction::checkEmptyData([$email, $password, $firstName, $lastName]);
            if ($isDataValid) {
                return $isDataValid;
            }
            if (!filter_var($email, FILTER_VALIDATE_EMAIL)) {
                return ['status' => 'error', 'details' => 'Your email is not valid'];
            }
            if ((strlen($firstName) < 2 && strlen($firstName) > 20) ||
                (strlen($lastName) < 2 && strlen($lastName) > 20)
            ) {
                return ['status'=>'error','details'=>'First name and last name should be more than 2 and less than 20 charachter'];
            }
            $newUser = new User();
            $newUser->email = trim($email);
            $newUser->first_name = trim($firstName);
            $newUser->last_name = trim($lastName);

            if (strlen($password) < 8 || strlen($password) > 20) {
                return ['status' => 'error', 'details' => 'Your password should be between 8 and 20 charachter'];
            }
            $newUser->password = Yii::$app->security->generatePasswordHash(trim($password));
            if ($newUser->validate()) {
                $newUser->save();

SELECT * FROM `user` WHERE `email`='nawlomuhammad@gmail.com'
SELECT EXISTS(SELECT * FROM `user` WHERE `user`.`email`='admin@gmail.com')
SELECT EXISTS(SELECT * FROM `user` WHERE `user`.`id`=1)
SELECT * FROM `user` WHERE `email`='nawlomuhammadit@gmail.com'
INSERT INTO `user` (`email`, `firstName`, `lastName`, `password`, `createdAt`) VALUES ('admin@gmail.com', 'Muhammad', 'Nawlo', '$2y$13$5jhi30KEzWVsOEaf60aZjOAw0p9cqZRhIs2Yop9qCv4S8Sjinsmgq', '2022-09-19')
DELETE FROM `contact` WHERE `userId`=1
---
    public function actionSaveUserInfo()
    {
        $errors = [];
        try {
            $data = (array)Yii::$app->request->post();
            if (!isset($data['email']))
                return ["status" => "error", "details" => "There is missing param"];

            $user = User::findOne(['email' => $data['email']]);
            if ($user === null) return ["status" => "error", "details" => "There is no user that has this email"];

            $user->load($data, '');
            $userContacts = isset($data['userContacts']) ? (array)$data['userContacts'] : [];
            $userImage = UploadedFile::getInstanceByName('userImage');
            if ($userImage !== null) {
                HelperFunction::createFolderIfNotExist(Url::to('@app/web/users/images'));
                HelperFunction::deletePhotos($user->img, 'users/images');
                $name = Yii::$app->security->generateRandomString(5) . '.' . $userImage->extension;
                $userImage->saveAs(Url::to('@app/web/users/images') . '/' . $name);
                $user->img = $name;
            }

            if ($userContacts) {
                Contact::deleteAll(['userId' => $user->id]);

UPDATE `user` SET `img`='kt-jD.jpg', `role`=1 WHERE `id`=1
---
            }

            if ($user->validate()) {
                $user->save();