controllers/SiteController.php

SELECT * FROM `user` WHERE `role`=2
---
    public function actionGetAllRepresentative()
    {

        $users = User::find()->where(['role'=>2])
            ->with('contacts', 'region', 'city', 'country')
            ->asArray()->all();